emacs.org
#+title: My Emacs configuration
#+author: Atri Hegde
#+description: An org file to describe, document and organise my Emacs configuration.
#+property: header-args:emacs-lisp :tangle ./init.el

GNU Emacs is not just a text editor, it's the ultimate tool for productivity.
This document contains my Emacs Configuration which is a main part of my workflow everyday.

* Table of Contents
:PROPERTIES:
:TOC:        :include all
:END:

:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#startup-performance][Startup performance]]
- [[#native-compilation][Native Compilation]]
- [[#package-management][Package management]]
- [[#keep-folders-clean][Keep folders clean]]
- [[#general-configuration][General Configuration]]
  - [[#user-interface][User Interface]]
    - [[#customize-per-mode][Customize per mode]]
  - [[#font][Font]]
  - [[#theme][Theme]]
  - [[#doom-modeline][Doom modeline]]
  - [[#keybind-panel][Keybind panel]]
  - [[#ivy-and-counsel][Ivy and Counsel]]
- [[#keyboard-bindings][Keyboard bindings]]
  - [[#escape-all][Escape all]]
  - [[#evil-time][Evil time]]
  - [[#leader-keybinds][Leader keybinds]]
  - [[#basic-keybinds-with-leader][Basic keybinds with leader]]
    - [[#base-commands][Base commands]]
    - [[#buffer-commands][Buffer commands]]
    - [[#window-commands][Window commands]]
    - [[#theme-toggle][Theme toggle]]
  - [[#keymaps-with-hydra][Keymaps with Hydra]]
- [[#org-mode][Org mode]]
  - [[#base-config][Base config]]
  - [[#org-agenda][Org-agenda]]
  - [[#org-bullets][Org bullets]]
  - [[#org-toc][Org TOC]]
  - [[#org-templates][Org templates]]
  - [[#configure-babel-languages][Configure Babel languages]]
    - [[#adding-mermaid-diagrams][Adding mermaid diagrams]]
  - [[#auto-tangle-configuration-files][Auto-tangle Configuration files]]
  - [[#visual-fill-column][Visual fill column]]
  - [[#org-present][Org-present]]
  - [[#roam][Roam]]
- [[#editing-configuration][Editing Configuration]]
  - [[#tab-widths][Tab widths]]
  - [[#spaces-instead-of-tabs][Spaces instead of tabs]]
  - [[#commenting-lines][Commenting lines]]
  - [[#automatically-clean-whitespace][Automatically clean whitespace]]
- [[#development][Development]]
  - [[#magit][Magit]]
    - [[#forge][Forge]]
  - [[#projectile][Projectile]]
  - [[#languages][Languages]]
    - [[#language-servers][Language Servers]]
      - [[#lsp-ui][lsp-ui]]
      - [[#lsp-treemacs][lsp-treemacs]]
      - [[#lsp-ivy][lsp-ivy]]
    - [[#rust][Rust]]
    - [[#astro][Astro]]
    - [[#go][Go]]
    - [[#typescript][TypeScript]]
    - [[#html][HTML]]
    - [[#emacs-lisp][Emacs Lisp]]
    - [[#yaml][YAML]]
  - [[#company-mode][Company mode]]
  - [[#productivity][Productivity]]
    - [[#workspaces-with-persp-mode][Workspaces with persp-mode]]
    - [[#dashboard][Dashboard]]
    - [[#highlight-todo][Highlight TODO]]
- [[#runtime-performance][Runtime performance]]
- [[#after-frame-hooks][After frame hooks]]
:END:

* Startup performance

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s seconds with %d garbage collections."
                       (emacs-init-time "%.2f")
                       gcs-done)))

#+end_src

* Native Compilation

Some options to improve experience on the =native-comp= branch of Emacs.

#+begin_src emacs-lisp

  ;; Silence compiler warnings as they can be pretty disruptive
  (setq native-comp-async-report-warnings-errors nil)

  ;; Set the right directory to store the native comp cache
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

#+end_src

* Package management

I manage my Emacs packages using =package.el= and =use-package=. I have an unless block
making sure that =use-package= is always installed, and packages installed with
use-package have =:ensure t= by default.

#+begin_src emacs-lisp

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  ;; (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t)
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* Keep folders clean

Keep folders where we edit files clean of any file that emacs creates.

#+begin_src emacs-lisp

  (use-package no-littering)
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src

* General Configuration
** User Interface

Making the interface more minimal.

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (tooltip-mode -1)        ; Disable tooltips
  (menu-bar-mode -1)       ; Disable the menu bar
  (tool-bar-mode -1)       ; Disable the tool bar
  (scroll-bar-mode -1)     ; Disable the scrollbar
  (setq visible-bell nil)  ; Visible bell disabled

  (set-frame-parameter (selected-frame) 'alpha '(97 . 100))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))

#+end_src

Relative line numbers. Really helpful when using evil mode.

#+begin_src emacs-lisp

  (column-number-mode)                           ; Enable column number
  (global-display-line-numbers-mode t)           ; Enable line numbers
  (menu-bar-display-line-numbers-mode 'relative) ; Make line numbers relative
  
#+end_src

*** Customize per mode

Remove line numbers in shell mode

#+begin_src emacs-lisp

  (dolist (mode '(term-mode-hook
                  eshell-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
#+end_src

** Font

My font of choice often varies, but I keep coming back to =JetBrains Mono=.
I alternate between =Cantarell= and =Overpass= for my variable space fonts.

#+begin_src emacs-lisp

  (defun ha/setup-font-main ()
    (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 125 :weight 'light)
    (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :height 125 :weight 'light)
    (set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :height 140 :weight 'light))

#+end_src

Using all-the-icons for pretty icons.

#+begin_src emacs-lisp

  (use-package all-the-icons
    :ensure t)
  
#+end_src

Rainbow delimiters. (attached on any buffer with programming mode)

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
  
#+end_src

** Theme

I like to use doom themes and occasionally the included themes.

#+begin_src emacs-lisp

  (use-package doom-themes
    :config
    (load-theme 'doom-palenight t))
  
#+end_src

** Doom modeline

#+begin_src emacs-lisp

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom (
      (doom-modeline-height 40)
      (doom-modeline-battery t)))
  
#+end_src

** Keybind panel

I am using which-key that helps me discover new keybinds and provides a pretty way to
rediscover my keybinds.

#+begin_src emacs-lisp

  (use-package which-key
    :defer 0
    ;; :init (which-key-mode)
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3))

#+end_src

** Ivy and Counsel

Ivy is my choice of completion engine for Emacs. Counsel gives me some commands such
as =counsel-find-file= replacing emacs =find-file= with a much nicer minibuffer(ivy).
Ivy-rich adds extra information to a few Counsel commands.

#+begin_src emacs-lisp

  (use-package swiper)
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line))
    :config
    (ivy-mode 1))
  (use-package counsel
    :bind(("M-x" . counsel-M-x)
          ("C-x b" . counsel-ibuffer)
          ("C-x C-f" . counsel-find-file))
    :config
    (setq ivy-initial-inputs-alist nil))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

#+end_src

* Keyboard bindings
** Escape all
This makes the =escape= key quit the minibuffer.
#+begin_src emacs-lisp

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  
#+end_src

** Evil time

#+begin_src emacs-lisp

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-keybinding nil)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    :config
    (evil-mode 1)
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

#+end_src

Evil collection package to enhance our evil :smiling_imp: experience.
#+begin_src emacs-lisp

  (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))

#+end_src

** Leader keybinds

Easy leader keymaps using =general.el=.

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-create-definer ha/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC"))
  
#+end_src

** Basic keybinds with leader

*** Base commands

#+begin_src emacs-lisp
  (ha/leader-keys
   "."  '(counsel-find-file :which-key "find file")
   "q"  '(:ignore t :which-key "emacs")
   "qq" '(save-buffers-kill-terminal :which-key "save and min")
   "qc" '(save-buffers-kill-emacs :which-key "save and close")
  )
#+end_src

*** Buffer commands

#+begin_src emacs-lisp

  (ha/leader-keys
   "b"  '(:ignore t :which-key "buffer")
   "bs" '(save-buffer :which-key "save")
   "bk" '(kill-current-buffer :which-key "kill")
   "bi" '(ibuffer :which-key "list")
   "bn" '(next-buffer :which-key "next buffer")
   "bu" '(previous-buffer :which-key "prev buffer")
  )

#+end_src

