emacs.org
*** Window commands

#+begin_src emacs-lisp

  (defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
       (next-win-buffer (window-buffer (next-window)))
       (this-win-edges (window-edges (selected-window)))
       (next-win-edges (window-edges (next-window)))
       (this-win-2nd (not (and (<= (car this-win-edges)
           (car next-win-edges))
             (<= (cadr this-win-edges)
           (cadr next-win-edges)))))
       (splitter
        (if (= (car this-win-edges)
         (car (window-edges (next-window))))
      'split-window-horizontally
    'split-window-vertically)))
  (delete-other-windows)
  (let ((first-win (selected-window)))
    (funcall splitter)
    (if this-win-2nd (other-window 1))
    (set-window-buffer (selected-window) this-win-buffer)
    (set-window-buffer (next-window) next-win-buffer)
    (select-window first-win)
    (if this-win-2nd (other-window 1))))))

  (ha/leader-keys
   "w"  '(:ignore t :which-key "window")
   "ws" '(split-window-vertically :which-key "vertical split")
   "wv" '(split-window-horizontally :which-key "horizontal split")
   "wc" '(delete-window :which-key "close window")
   "wh" '(evil-window-left :which-key "go to left window")
   "wl" '(evil-window-right :which-key "go to right window")
   "wj" '(evil-window-down :which-key "go down a window")
   "wk" '(evil-window-up :which-key "go up a window")
   "wH" '(evil-window-increase-height :which-key "increase height")
   "wL" '(evil-window-decrease-height :which-key "decrease height")
   "wJ" '(evil-window-increase-width :which-key "increase width")
   "wK" '(evil-window-decrease-width :which-key "decrease width")
   "w=" '(balance-windows :which-key "balance windows")
   "ww" '(toggle-window-split :which-key "change split")
  )

#+end_src

*** Theme toggle

#+begin_src emacs-lisp

  (ha/leader-keys
   "t"  '(:ignore t :which-key "toggles")
   "tt" '(counsel-load-theme :which-key "Choose theme"))
  
#+end_src

** Keymaps with Hydra

Cool/useful keymaps with hydra

#+begin_src emacs-lisp

  (use-package hydra
    :defer t)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (ha/leader-keys
    "ts" '(hydra-text-scale/body :which-key "Scale text"))

#+end_src

* Org mode
** Base config

Configuring the org package.

#+begin_src emacs-lisp

  (defun ha/org-mode-setup ()
    (org-indent-mode)
    ;; (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    ;; Enlarge latex preview
    (plist-put org-format-latex-options :scale 1.6)
    (setq org-return-follows-link t)
    (setq evil-auto-indent nil))

  ;; Replace list hyphen with dot.
  (defun ha/org-font-setup ()
    (font-lock-add-keywords 'org-mode
                           '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
    ;; Change font size of headings. 
    (dolist (face '((org-level-1 . 1.5)
                    (org-level-2 . 1.4)
                    (org-level-3 . 1.3)
                    (org-level-4 . 1.25)
                    (org-level-5 . 1.2)
                    (org-level-6 . 1.15)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.05)))
      (set-face-attribute (car face) nil :font "Overpass" :weight 'medium :height (cdr face)))

  ;; Fonts in org
    (set-face-attribute 'org-document-title nil :font "Iosevka Aile" :weight 'bold :height 1.3)
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

  (use-package org
    :commands (org-capture org-agenda)
    :hook (org-mode . ha/org-mode-setup)
    :config
    (setq org-ellipsis " ▼ "
          org-hide-emphasis-markers t)
    (ha/org-font-setup))

#+end_src

** Org-agenda

Org agenda prefs. TODO: org-ql.

#+begin_src emacs-lisp

  (setq-default org-agenda-files '("~/org"))
  ;; (setq org-agenda-files (directory-files-recursively "~/org/" "\\.org$"))

#+end_src

Keybinds for org agenda.

#+begin_src emacs-lisp

  (ha/leader-keys
   "o"   '(:ignore t :which-key "org")
   "oa"  '(org-agenda :which-key "org-agenda")
   "od"  '(org-time-stamp :which-key "time stamp")
   "op" '(:ignore t :which-key "priority")
   "opp" '(org-priority :which-key "priority")
   "opu" '(org-priority-up :which-key "priority")
   "opd" '(org-priority-down :which-key "priority")
  )
#+end_src

** Org bullets

Replace =*= with different bullets.

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (setq org-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")))

#+end_src

** Org TOC

A plugin that generates a TOC for org documents on save.

#+begin_src emacs-lisp
  (use-package org-make-toc)
#+end_src

** Org templates

Templates for expanding a source code block.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("me" . "src mermaid :file d"))
    (add-to-list 'org-structure-template-alist '("python" . "src python"))
    (add-to-list 'org-structure-template-alist '("rs" . "src rust"))
    (add-to-list 'org-structure-template-alist '("cf" . "src conf")))

#+end_src

** Configure Babel languages

*** Adding mermaid diagrams

#+begin_src emacs-lisp

  ;; (use-package ob-mermaid)
  ;; (setq ob-mermaid-cli-path "/usr/bin/mmdc")

  (with-eval-after-load 'org
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        ;;(mermaid .t)
        ;;(scheme .t)
        (python . t))))

#+end_src

** Auto-tangle Configuration files

#+begin_src emacs-lisp

  ;; Automatically tangle emacs.org whenever it is saved.
  (defun ha/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                       (expand-file-name "~/.emacs.d/emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'ha/org-babel-tangle-config)))

#+end_src

** Visual fill column

Make working with org files pretty and centered.

#+begin_src emacs-lisp

  (defun ha/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . ha/org-mode-visual-fill))
  
#+end_src

** Org-present

Give presentations using org-mode.

#+begin_src emacs-lisp

  (use-package org-present)

  ;; Tweak our font sizes during present
  (defun ha/org-present-start ()
    (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                       (header-line (:height 4.0) variable-pitch)
                                       (org-document-title (:height 1.75) org-document-title)
                                       (org-code (:height 1.55) org-code)
                                       (org-verbatim (:height 1.55) org-verbatim)
                                       (org-block (:height 1.25) org-block)
                                       (org-block-begin-line (:height 0.7) org-block)))
    (setq header-line-format " ")
    (display-line-numbers-mode -1))

  ;; Undo tweaks 
  (defun ha/org-present-end ()
    (setq-local face-remapping-alist '((default variable-pitch default)))
    (setq header-line-format nil)
    (display-line-numbers-mode nil))

  ;; Preparing the slides
  (defun ha/org-present-prepare-slide (buffer-name heading)
    (org-overview)
    (org-show-entry)
    (org-show-children))

  (add-hook 'org-present-after-navigate-functions 'ha/org-present-prepare-slide)
  (add-hook 'org-present-mode-hook 'ha/org-present-start)
  (add-hook 'org-present-mode-quit-hook 'ha/org-present-end)

#+end_src

