init.el

(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory "~/org/roam")
  (org-roam-capture-templates
    '(("d" "default" plain
       "%?"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+startup: latexpreview\n")
       :unnarrowed t)
      ("m" "module" plain
       ;; (file "<path to template>")
       "\n* Module details\n\n- %^{Module code}\n- Semester: %^{Semester}\n\n* %?"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: latexpreview\n")
       :unnarrowed t)
      ("b" "book notes" plain
       "\n* Source\n\n- Author: %^{Author}\n- Title: ${title}\n- Year: %^{Year}\n\n%?"
       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: latexpreview\n")
       :unnarrowed t)
    )
  )
  (setq org-roam-dailies-capture-templates
    '(("d" "default" entry "* %<%H:%M>: %?"
       :ifnew (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))
    )
  )
  :bind-keymap
  ("C-c n d" . org-roam-dailes-map)
  :config
  (org-roam-setup))

;; Keybinds
(ha/leader-keys
 "n"  '(:ignore t :which-key "roam notes")
 "nt" '(org-roam-buffer-toggle :which-key "buffer toggle")
 "nf" '(org-roam-node-find :which-key "find node")
 "ni" '(org-roam-node-insert :which-key "insert node")
 "nb" '(org-roam-buffer-toggle :which-key "backlinks")
 "ng" '(org-roam-graph :which-key "graph")
 ;; Heading/Links
 "nh"  '(:ignore t :which-key "heading")
 "nhi" '(org-id-get-create :which-key "insert")
 "nha" '(org-roam-alias-add :which-key "add alias")
 "nhf" '(org-find-entry-with-id :which-key "find")
 ;; Dailies
 "nd"  '(:ignore t :whick-key "dailies")
 "ndn" '(org-roam-dailies-capture-today :whick-key "capture today")
 "ndN" '(org-roam-dailies-goto-today :which-key "goto today")
 "ndy" '(org-roam-dailies-goto-yesterday :which-key "goto yesterday")
 "ndY" '(org-roam-dailies-capture-yesterday :which-key "capture yesterday")
 "ndt" '(org-roam-dailies-goto-tomorrow :which-key "goto tomorrow")
 "ndT" '(org-roam-dailies-capture-tomorrow :which-key "capture tomorrow")
 "ndd" '(org-roam-dailies-capture-date :which-key "capture date")
 "ndD" '(org-roam-dailies-goto-date :which-key "goto date")
 "ndf" '(org-roam-dailies-goto-next-note :which-key "next note")
 "ndb" '(org-roam-dailies-goto-previous-note :which-key "prev note")
)

(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)

(setq-default indent-tabs-mode nil)

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package magit
  :commands (magit-status magit-commit magit-push)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(ha/leader-keys
 "g"  '(:ignore t :which-key "Magit")
 "gg" '(magit-status :which-key "status")
 "gs" '(magit-status :which-key "status")
 "gc" '(magit-commit :which-key "commit")
 "gp" '(magit-push :which-key "push"))

;; TODO, setup
(use-package forge
  :after magit)

(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/repos")
    (setq projectile-project-search-path'("~/repos")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(defun ha/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . ha/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

;; Enable debugger
(use-package dap-mode
  ;; :after lsp-mode
  :commands dap-debug)

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(ha/leader-keys
 "o"  '(:ignore t :which-key "open")
 "ot" '(treemacs :which-key "Treemacs")
 "os" '(lsp-treemacs-symbols :which-key "LSP treemacs symols")
 )

(use-package lsp-ivy
  :after lsp)

(use-package rust-mode
  :mode "\\.rs\\'"
  :hook (rust-mode . lsp-deferred)
  :init (setq rust-format-on-save t))

(use-package cargo
  :defer t)

(define-derived-mode astro-mode web-mode "astro")
(setq auto-mode-alist
      (append '((".*\\.astro\\'" . astro-mode))
              auto-mode-alist))

(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration
               '(astro-mode . "astro"))

  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("astro-ls" "--stdio"))
                    :activation-fn (lsp-activate-on "astro")
                    :server-id 'astro-ls)))

(use-package go-mode
  :hook (go-mode . lsp-deferred))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package yaml-mode
  :mode "\\.ya?ml\\'")

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package persp-mode
  :config
  (persp-mode 1))

(ha/leader-keys
 "TAB"  '(:ignore t :which-key "workspaces")
 "TAB n" '(persp-add-new :which-key "add")
)

(use-package dashboard
  :config
  (dashboard-setup-startup-hook))

;; Make dashboard the default buffer in emacsclient
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
