emacs.org
*** Highlight TODO

Highlight keywords like =TODO=, =FIXME=, etc.

#+begin_src emacs-lisp
  
  (use-package hl-todo
    :hook ((prog-mode . hl-todo-mode) (org-mode . hl-todo-mode))
    :config
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces
          `(("TODO"        warning bold)
            ("FIXME"       error bold)
            ("HACK"        font-lock-constant-face bold)
            ("REVIEW"      font-lock-keyword-face bold)
            ("NOTE"        success bold)
            ("DEPRECATED"  font-lock-doc-face bold))))

#+end_src

* Runtime performance

Dial the GC threshold back down so GC happens more frequently but in less time.

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 2 1000 1000))
  
#+end_src

* After frame hooks

For some reason, my emacs running in daemon mode fails to render the correct fonts.

#+begin_src emacs-lisp

  ;; Main fonts
  (add-hook 'after-init-hook 'ha/setup-font-main)
  (add-hook 'server-after-make-frame-hook 'ha/setup-font-main)
  ;; Fonts in org mode 
  (add-hook 'after-init-hook 'ha/org-font-setup)
  (add-hook 'server-after-make-frame-hook 'ha/org-font-setup)

#+end_src
